app/controllers/api/v1/authentication_controller.rb

    def create
        user = User.find_by(username: params.require(:username))
---
SELECT "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "seller"], ["LIMIT", 1]]