app/controllers/api/v1/books_controller.rb

  def index
    books = Book.limit(limit).offset(params[:offset])
---
SELECT "books".* FROM "books" LIMIT ? OFFSET ?  [["LIMIT", 1], ["OFFSET", 1]]

  def create
    # binding.irb
    author = Author.create!(author_params)
    # since i cannot merge an object to a hash on new, i will pass author_id to the hash
    @book = Book.new(book_params.merge(author_id: author.id))

    if @book.save
---
INSERT INTO "authors" ("first_name", "last_name", "age", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["first_name", "Andy"], ["last_name", "Weir"], ["age", 48], ["created_at", "2023-03-27 12:49:54.593001"], ["updated_at", "2023-03-27 12:49:54.593001"]]
INSERT INTO "books" ("title", "created_at", "updated_at", "author_id") VALUES (?, ?, ?, ?)  [["title", "The Martian"], ["created_at", "2023-03-27 12:49:54.601461"], ["updated_at", "2023-03-27 12:49:54.601461"], ["author_id", 1]]

  def destroy
    Book.find(params[:id]).destroy!
---
DELETE FROM "books" WHERE "books"."id" = ?  [["id", 1]]
SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]